In [1]:
import pandas as pd

### Series

In [15]:
ser=pd.Series(['a','b','c','d','e'],[1,2,6,4,5])

In [16]:
print(ser)

1    a
2    b
6    c
4    d
5    e
dtype: object

In [17]:
ser.index

Index([1, 2, 6, 4, 5], dtype='int64')

In [24]:
ser.loc[[4,5,6]]

4    d
5    e
6    c
dtype: object

In [23]:
ser[[1,4,5]]

1    a
4    d
5    e
dtype: object

In [27]:
ser.iloc[3]

'd'

In [31]:
ser[[1]]*30

1    aaaaaaaaaaaaaaaaaaaaaaaaaaaaaa
dtype: object

### Dataframe

In [120]:
a={'one':pd.Series([10,20,30,40,50],index=['a','b','c','d','e']),
    'two':pd.Series([-10,-20,-30,-40,-50],index=['a','b','c','d','e'])
  }

In [42]:
df=pd.DataFrame(a)

In [43]:
print(df)

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [44]:
df

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [45]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [46]:
df.loc['b']

one    20
two   -20
Name: b, dtype: int64

In [47]:
df.loc['d']

one    40
two   -40
Name: d, dtype: int64

In [50]:
df.iloc[3]

one    40
two   -40
Name: d, dtype: int64

In [92]:
b={'english':([90,23,35,40,50]),
    'math':([60,80,30,20,95]),
   'science':([50,60,70,40,100]),
  }

In [93]:
ad=pd.DataFrame(b,index=['avi','bishal','chan','dro','ellle'],columns=['english','math','science'])

In [94]:
ad

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100

In [95]:
ad.loc[['avi']]

     english  math  science
avi       90    60       50

In [96]:
ad.iloc[2]

english    35
math       30
science    70
Name: chan, dtype: int64

In [97]:
data=[{'ram':100,'Shyam':200} ,{'ema':50,'ramu':80}]

In [98]:
df1=pd.DataFrame(data)

In [99]:
df1

     ram  Shyam   ema  ramu
0  100.0  200.0   NaN   NaN
1    NaN    NaN  50.0  80.0

In [100]:
df1=pd.DataFrame(data,index=['First number','Second NUmber'])

In [101]:
df1

                 ram  Shyam   ema  ramu
First number   100.0  200.0   NaN   NaN
Second NUmber    NaN    NaN  50.0  80.0

In [102]:
df2=pd.DataFrame(data,columns=['ram','ema'])

In [103]:
df2

     ram   ema
0  100.0   NaN
1    NaN  50.0

In [109]:
c={'english':([90,23,35,40,50,80,90,99,89]),
    'math':([60,80,30,20,95,70,77,89,90]),
   'science':([50,60,70,40,100,56,55,66,70]),
  }
marks=pd.DataFrame(c,index=['avi','bishal','chan','dro','ellle','sita','gita','sarita','sabin'])

In [111]:
marks

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70

### head & tail

In [114]:
type(marks)

pandas.core.frame.DataFrame

In [115]:
marks.head()

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100

In [118]:
marks.head(8)

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66

In [116]:
marks.tail()

        english  math  science
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70

In [119]:
marks.tail(4)

        english  math  science
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70